0xsmirk/mcu_cmsis_svd/Spansion/MB9BF11xT.svd
        <!-- REGISTER "ADST1" -->
        <register>
          <name>ADST1</name>
          <description>Sampling Time Setup Register 1</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STX1" -->
            <field>
              <name>STX1</name>
              <description>Sampling time N times setting bits</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST" -->
            <field>
              <name>ST</name>
              <description>Sampling time setting bits</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADST0" -->
        <register>
          <name>ADST0</name>
          <description>Sampling Time Setup Register 0</description>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STX0" -->
            <field>
              <name>STX0</name>
              <description>Sampling time N times setting bits </description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST" -->
            <field>
              <name>ST</name>
              <description>Sampling time setting bits</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCT" -->
        <register>
          <name>ADCT</name>
          <description>Comparison Time Setup Register</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x07</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CT" -->
            <field>
              <name>CT</name>
              <description>Compare clock frequency division ratio setting bits</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRTSL" -->
        <register>
          <name>PRTSL</name>
          <description>Priority Conversion Timer Trigger Selection Register</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRTSL" -->
            <field>
              <name>PRTSL</name>
              <description>Priority conversion timer trigger selection bit </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCTSL" -->
        <register>
          <name>SCTSL</name>
          <description>Scan Conversion Timer Trigger Selection Register</description>
          <addressOffset>0x39</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCTSL" -->
            <field>
              <name>SCTSL</name>
              <description>Scan conversion timer trigger selection bit </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCEN" -->
        <register>
          <name>ADCEN</name>
          <description>A/D Operation Enable Setup Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x33</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CYCLSL" -->
            <field>
              <name>CYCLSL</name>
              <description>Basic cycle selection bit </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "READY" -->
            <field>
              <name>READY</name>
              <description>A/D operation enable state bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ENBL" -->
            <field>
              <name>ENBL</name>
              <description>A/D operation enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "ADC1" -->
    <peripheral derivedFrom="ADC0">
      <name>ADC1</name>
      <baseAddress>0x40027100</baseAddress>
      <!-- INTERRUPT "ADC1" -->
      <interrupt>
        <name>ADC1</name>
        <value>26</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "ADC2" -->
    <peripheral derivedFrom="ADC0">
      <name>ADC2</name>
      <baseAddress>0x40027200</baseAddress>
      <!-- INTERRUPT "ADC2" -->
      <interrupt>
        <name>ADC2</name>
        <value>27</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "EXTI" -->
    <peripheral>
      <name>EXTI</name>
      <description>External Interrupt and NMI Control</description>
      <groupName>EXTI</groupName>
      <baseAddress>0x40030000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "EXTINT0_7" -->
      <interrupt>
        <name>EXTINT0_7</name>
        <value>4</value>
      </interrupt>
      <!-- INTERRUPT "EXTINT8_31" -->
      <interrupt>
        <name>EXTINT8_31</name>
        <value>5</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "ENIR" -->
        <register>
          <name>ENIR</name>
          <description>Enable Interrupt Request Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EN31" -->
            <field>
              <name>EN31</name>
              <description>Bit31 of ENIR</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN30" -->
            <field>
              <name>EN30</name>
              <description>Bit30 of ENIR</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN29" -->
            <field>
              <name>EN29</name>
              <description>Bit29 of ENIR</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN28" -->
            <field>
              <name>EN28</name>
              <description>Bit28 of ENIR</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN27" -->
            <field>
              <name>EN27</name>
              <description>Bit27 of ENIR</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN26" -->
            <field>
              <name>EN26</name>
              <description>Bit26 of ENIR</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN25" -->
            <field>
              <name>EN25</name>
              <description>Bit25 of ENIR</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN24" -->
            <field>
              <name>EN24</name>
              <description>Bit24 of ENIR</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN23" -->
            <field>
              <name>EN23</name>
              <description>Bit23 of ENIR</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN22" -->
            <field>
              <name>EN22</name>
              <description>Bit22 of ENIR</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN21" -->
            <field>
              <name>EN21</name>
              <description>Bit21 of ENIR</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN20" -->
            <field>
              <name>EN20</name>
              <description>Bit20 of ENIR</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN19" -->
            <field>
              <name>EN19</name>
              <description>Bit19 of ENIR</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN18" -->
            <field>
              <name>EN18</name>
              <description>Bit18 of ENIR</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN17" -->
            <field>
              <name>EN17</name>
              <description>Bit17 of ENIR</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN16" -->
            <field>
              <name>EN16</name>
              <description>Bit16 of ENIR</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN15" -->
            <field>
              <name>EN15</name>
              <description>Bit15 of ENIR</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN14" -->
            <field>
              <name>EN14</name>
              <description>Bit14 of ENIR</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN13" -->
            <field>
              <name>EN13</name>
              <description>Bit13 of ENIR</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN12" -->
            <field>
              <name>EN12</name>
              <description>Bit12 of ENIR</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN11" -->
            <field>
              <name>EN11</name>
              <description>Bit11 of ENIR</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN10" -->
            <field>
              <name>EN10</name>
              <description>Bit10 of ENIR</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN9" -->
            <field>
              <name>EN9</name>
              <description>Bit9 of ENIR</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN8" -->
            <field>
              <name>EN8</name>
              <description>Bit8 of ENIR</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN7" -->
            <field>
              <name>EN7</name>
              <description>Bit7 of ENIR</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN6" -->
            <field>
              <name>EN6</name>
              <description>Bit6 of ENIR</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN5" -->
            <field>
              <name>EN5</name>
              <description>Bit5 of ENIR</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN4" -->
            <field>
              <name>EN4</name>
              <description>Bit4 of ENIR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN3" -->
            <field>
              <name>EN3</name>
              <description>Bit3 of ENIR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN2" -->
            <field>
              <name>EN2</name>
              <description>Bit2 of ENIR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN1" -->
            <field>
              <name>EN1</name>
              <description>Bit1 of ENIR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EN0" -->
            <field>
              <name>EN0</name>
              <description>Bit0 of ENIR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
